<?php

namespace Database\Seeders\products;


use Illuminate\Database\Seeder;
use App\Models\Category;
use App\Models\Product;
use App\Models\ProductImage;

class HomeProductsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $products = [
            [
                'name' => 'Комплект за филтриране на вода Freshwater Compact MF',
                'slug' => 'freshwater-compact-mf',
                'short_description' => 'Осигурете си непрестанен достъп до качествена, пречистена на мига вода с невероятен вкус директно от кухненския смесител. Без пренасяне, без допълнителни разходи – само с едно движение. С FRESHWATER COMPACT MF всяка капка вода е чиста и освежаваща! Гарантирано качество и удобство за цялото семейство с комплекта за филтриране на вода FreshWater Compact MF Дългосрочно решение за качествена вода за пиене и готвене във Вашият дом. Удобството да разполагате с филтрирана вода на мига във вашия дом, без необходимост от постоянно пренасяне и съхранение на големи количества бутилирана вода. Оптимизиране на разходите за вода за пиене и готвене. Свежа и вкусна вода – без неприятен вкус и мирис на хлор. Здраве с всяка капка вода, без вредните примеси, бактерии и вируси. Бърз и лесен монтаж – само няколко минути.',
                'description' => 'Винаги качествена филтрирана вода Freshwater Compact MF  ви осигурява до 12 000 литра филтрирана на мига вода без допълнителни разходи. Това се равнява на 630 галона вода за диспенсър, 8000 бутилки с вода от 1,5 литра или 60 000 чаши вода. Капацитет на филтъра Ви гарантира непрестанен достъп до качествена вода за пиене и готвене, без притеснение за използваното количество. Карбонов филтър за вода с микрофилтрация със селективна пропускливост от 0.5 микрона гарантирано премахва вредни примеси и съединения като хлор, пестициди, фенол, бензол, производни на хлор, разтворители, полиароматни съединения, микроорганизми, бактерии и вируси, запазвайки полезните минерали във водата. Бактериостатичната сребърна добавка спомага за премахването бактерии от водата и не позволява тяхното повторно развитие след премахването на хлора. Лесен монтаж и обслужване В комплекта за филтриране на вода FreshWater Compact MF  ще откриете всички необходими елементи за бърз и лесен монтаж, без нужда от специални инструменти или предварителна подготовка. Монтирайте само за няколко минути и се насладете на винаги свежа, филтрирана вода във Вашия дом! Подмяната на филтъра за вода е изключително бърза и лесна – само след няколко секунди новият филтър е готов за употреба! Комплектът за филтриране на вода включва: Филтър за вода с микрофилтрация FC 135 AG Филтърна глава Гъвкава връзка 3/8 – 1 брой Аксесоари за монтаж Инструкции за монтаж Перфектното решение за всеки дом Не правете компромиси със здравето си и качеството на водата, която пиете. Качествена, пречистена на мига вода с перфектен вкус, без пренасяне на вода, без допълнителни разходи – само с едно движение. Комплект за филтриране на вода FreshWater Compact MF  сигурен партньор в осигуряването на здраве на вашето семейство.',
                'installation_video_url' => 'https://www.youtube.com/watch?v=77_9FMbf-qw&t=3s',
                'price' => 220.00,
                'sale_price' => 180.00,
                'stock' => 10,
                'images' => [
                    ['path' => '1.jpg', 'primary' => true],
                    ['path' => '2.jpg'],
                    ['path' => '3.jpg'],
                    ['path' => '4.jpg'],
                    ['path' => '5.jpg'],
                    ['path' => '6.jpg'],
                    ['path' => 'des-1.jpg'],
                    ['path' => 'des-2.jpg'],
                    ['path' => 'des-3.jpg'],
                    ['path' => 'des-4.jpg'],
                    ['path' => 'des-5.jpg'],
                ]

            ],
            [
                'name' => 'Комплект за филтриране на вода с Freshwater Compact MF+',
                'slug' => 'freshwater-compact-mf+',
                'short_description' => 'Комфорта да разполагате с непрестанен достъп до свежа и вкусна вода във Вашия дом, никога не е бил по-достъпен! С Freshwater Compact MF  + всяка капка вода е чиста и освежаваща. Специално проектираният смесител Ви дава удобството да имате пречистена на мига вода само с едно движение. Гарантирано качество и удобство за цялото семейство с комплекта за филтриране на вода FreshWater Compact MF + Дългосрочно решение за качествена вода за пиене и готвене в дома Ви. Удобството да разполагате с качествена, филтрирана вода на мига  във вашия дом, без необходимост от постоянно пренасяне и съхранение на големи количества бутилирана вода. Оптимизиране на разходите за вода за пиене и готвене. Свежа и вкусна вода – без неприятен мирис на хлор. Здраве с всяка капка вода, премахвайки вредните примеси, бактерии и вируси. Бърз и лесен монтаж – само няколко минути.',
                'description' => 'Винаги качествена филтрирана вода Freshwater Compact MF + ви осигурява до 6000 литра филтрирана на мига вода без допълнителни разходи. Това се равнява на 315 галона вода за диспенсър, 4000 бутилки с вода от 1,5 литра или 30 000 чаши вода. Капацитет на филтъра Ви гарантира непрестанен достъп до качествена вода за пиене и готвене, без притеснение за използваното количество. Карбонов филтър за вода с микрофилтрация със селективна пропускливост от 0.5 микрона гарантирано премахва вредни примеси и съединения като хлор, пестициди, фенол, бензол, производни на хлор, разтворители, полиароматни съединения, микроорганизми, бактерии и вируси, запазвайки полезните минерали във водата. Бактериостатичната сребърна добавка спомага за премахването бактерии от водата и не позволява тяхното повторно развитие след премахването на хлора. Лесен монтаж и обслужване В комплекта за филтриране на вода FreshWater Compact + ще откриете всички необходими елементи за бърз и лесен монтаж, без нужда от специални инструменти или предварителна подготовка. Монтирайте само за няколко минути и се насладете на винаги свежа, филтрирана вода във Вашия дом! Подмяната на филтъра за вода е изключително бърза и лесна – само след няколко секунди новият филтър е готов за употреба! Комплектът за филтриране на вода включва: Смесител за пречистена вода Филтър за вода MC 135 AG Филтърна глава Междинен спирателен кран Шлаух 1/4 – 2 броя Аксесоари за монтаж Инструкции за монтаж Перфектното решение за всеки дом Не правете компромиси със здравето си и качеството на водата, която пиете. Качествена, пречистена на мига вода с перфектен вкус, без пренасяне на вода, без допълнителни разходи – само с едно движение. Комплект за филтриране на вода FreshWater Compact MF  сигурен партньор в осигуряването на здраве на вашето семейство.',
                'installation_video_url' => 'https://www.youtube.com/watch?v=77_9FMbf-qw&t=2s',
                'price' => 240.00,
                'sale_price' => 200.00,
                'stock' => 10,
                'images' => [
                    ['path' => '1.jpg', 'primary' => true],
                    ['path' => '2.jpg'],
                    ['path' => '3.jpg'],
                    ['path' => '4.jpg'],
                    ['path' => '5.jpg'],
                    ['path' => '6.jpg'],
                    ['path' => 'des-1.jpg'],
                    ['path' => 'des-2.jpg'],
                    ['path' => 'des-3.jpg'],
                    ['path' => 'des-4.jpg'],
                    ['path' => 'des-5.jpg'],
                ]

            ],
            [
                'name' => 'Комплект за филтриране на вода с Freshwater Compact UF',
                'slug' => 'freshwater-compact-uf',
                'short_description' => 'Осигурете си непрестанен достъп до качествена, пречистена на мига вода с невероятен вкус директно от кухненския смесител. Без пренасяне, без допълнителни разходи – само с едно движение. С FRESHWATER COMPACT UF всяка капка вода е чиста и освежаваща! Гарантирано качество и удобство за цялото семейство с комплекта за филтриране на вода FreshWater Compact UF Дългосрочно решение за качествена вода за пиене и готвене във Вашият дом. Удобството да разполагате с филтрирана вода на мига във вашия дом, без необходимост от постоянно пренасяне и съхранение на големи количества бутилирана вода. Оптимизиране на разходите за вода за пиене и готвене. Свежа и вкусна вода – без неприятен вкус и мирис на хлор. Здраве с всяка капка вода, без вредните примеси, бактерии и вируси. Бърз и лесен монтаж – само няколко минути.',
                'description' => 'Винаги качествена филтрирана вода Freshwater Compact UF  ви осигурява до 12 000 литра филтрирана на мига вода без допълнителни разходи. Това се равнява на 630 галона вода за диспенсър, 8 000 бутилки с вода от 1,5 литра или 60 000 чаши вода. Капацитет на филтъра Ви гарантира непрестанен достъп до качествена вода за пиене и готвене, без притеснение за използваното количество. Карбонов филтър за вода с ултрафилтрация със селективна пропускливост от 0.1 микрона гарантирано премахва вредни примеси и съединения като хлор, пестициди, фенол, бензол, производни на хлор, разтворители, полиароматни съединения, микроорганизми, бактерии и вируси, запазвайки полезните минерали във водата. Бактериостатичната сребърна добавка спомага за премахването бактерии от водата и не позволява тяхното повторно развитие след премахването на хлора. Лесен монтаж и обслужване В комплекта за филтриране на вода FreshWater Compact UF  ще откриете всички необходими елементи за бърз и лесен монтаж, без нужда от специални инструменти или предварителна подготовка. Монтирайте само за няколко минути и се насладете на винаги свежа, филтрирана вода във Вашия дом! Подмяната на филтъра за вода е изключително бърза и лесна – само след няколко секунди новият филтър е готов за употреба! Комплектът за филтриране на вода включва: Филтър за вода с ултрафилтрация FCU 15-01 AG Филтърна глава Гъвкава връзка 3/8 – 1 брой Аксесоари за монтаж Инструкции за монтаж Перфектното решение за всеки дом Не правете компромиси със здравето си и качеството на водата, която пиете. Качествена, пречистена на мига вода с перфектен вкус, без пренасяне на вода, без допълнителни разходи – само с едно движение. Комплект за филтриране на вода FreshWater Compact UF  сигурен партньор в осигуряването на здраве на вашето семейство.',
                'installation_video_url' => 'https://www.youtube.com/watch?v=RzloXtAK_kU',
                'price' => 290.00,
                'sale_price' => 260.00,
                'stock' => 10,
                'images' => [
                    ['path' => '1.jpg', 'primary' => true],
                    ['path' => '2.jpg'],
                    ['path' => '3.jpg'],
                    ['path' => '4.jpg'],
                    ['path' => '5.jpg'],
                    ['path' => '6.jpg'],
                    ['path' => 'des-1.jpg'],
                    ['path' => 'des-2.jpg'],
                    ['path' => 'des-3.jpg'],
                    ['path' => 'des-4.jpg'],
                    ['path' => 'des-5.jpg'],
                ]

            ],

        ];

        $category = Category::where('slug', 'za-doma-sistemi-za-voda')->firstOrFail();
       
        foreach ($products as $data) 
        {
            $product = Product::create([
                'category_id' => $category->id,
                'name' => $data['name'],
                'slug' => $data['slug'],
                'short_description' => $data['short_description'],
                'description' => $data['description'],
                'installation_video_url' => $data['installation_video_url'],
                'price' => $data['price'],
                'sale_price' => $data['sale_price'],
                'stock' => $data['stock'],
            ]);

            foreach ($data['images'] as $index => $image) {
                ProductImage::create([
                    'product_id' => $product->id,
                    'image_path' => "products/{$data['slug']}/{$image['path']}",
                    'is_primary' => $image['primary'] ?? false,
                    'sort_order' => $index + 1,
                ]);
            }
        }
    }
}
